ГТС/УТГТС/Reports/ОтчетПоОбращениямКлиентовПоРекламе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОтчетПоОбращениямКлиентовПоРекламе</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/ИсточникиПервичногоИнтереса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсточникиПервичногоИнтереса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КаналПервичногоИнтереса</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникПервичногоИнтереса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/Catalogs/СегментыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СегментыНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОчистки</Name>
					<Comment>Временное ограничение существования сегмента</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФормированияСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/Catalogs/СтруктураПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтруктураПредприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущийРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбособленногоУчетаТоваров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОбособленногоУчетаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Баннер</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетСтруктуреЮридическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПланирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоИнтервалаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеИнтервалаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеМаршрутнымиЛистами</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеДоступностиДляРасписанияРЦКоличествоИнтервалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеДоступностиДляРасписанияРЦНапоминаниеДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеДоступностиДляГрафикаПроизводстваКоличествоИнтервалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПооперационногоУправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеДоступностиДляГрафикаПроизводстваНапоминаниеДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДиспетчер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСерииНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНаРегистрациюВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНаРегистрациюВыполненияЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьСебестоимостьПоСериям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводствоПоЗаказам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводствоБезЗаказов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяСписаниеЗатратНаВыпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолученияПолуфабрикатов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПооперационноеУправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМатериалыВОперациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВыходныеИзделияВОперациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПооперационноеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьОформленияВыработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКТУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТарифныеСтавки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтработанноеВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБригадныеНаряды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПерсональныеНаряды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНастройкиГрафикаРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНастройкиГрафикаРаботыПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСменныеЗадания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПроизводственныеУчастки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОрганизацийПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентРастяженияГрафикаПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикиРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/Reports/ОтчетПоОбращениямКлиентовПоРекламе/Forms/ФормаОтчета/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ НА СЕРВЕРЕ

&НаСервере
Процедура УдалитьПустыеЗначения(Список)
	ВсегоСтрок = Список.Количество();
	i = 0;
	Пока i < ВсегоСтрок Цикл
		ТекЭлемент = Список[i];
		Если НЕ ЗначениеЗаполнено(ТекЭлемент.Значение) Тогда
			Список.Удалить(ТекЭлемент);
			ВсегоСтрок = ВсегоСтрок - 1;
		Иначе
			i = i + 1;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры//УдалитьПустыеЗначения(Список)

&НаСервере
Процедура ДобавитьВеткуВДеревоДанныхНаСервере(Выборка, СтрокиДанных)
	
	Уровень = Выборка.Уровень();
	ЭлементГруппировки = СЗ_Группировки.Получить(Уровень);
	ИмяГруппировки = ЭлементГруппировки.Значение;
	
	Если НомерГруппировкиДоРегиона = -1 И ВыводитьРегионы Тогда
		// добавляем все регионы
		Для каждого ЭлементРегион Из СЗ_Регионы Цикл
			СтрокаДанныхРегион = СтрокиДанных.Добавить();
			СтрокаДанныхРегион.Параметр = ЭлементРегион.Значение;
		КонецЦикла;
		НомерГруппировкиДоРегиона = -2;
	ИначеЕсли НомерГруппировкиДоРекламы = -1 И ВыводитьРекламу Тогда
		// добавляем все рекламы
		Для каждого СтрокаКанал Из ДЗ_Реклама.ПолучитьЭлементы() Цикл
			СтрокаДанныхКанал = СтрокиДанных.Добавить();
			СтрокаДанныхКанал.Параметр = СтрокаКанал.Параметр;	
			Для каждого СтрокаИсточник Из СтрокаКанал.ПолучитьЭлементы() Цикл
				СтрокаДанныхИсточник = СтрокаДанныхКанал.Строки.Добавить();
				СтрокаДанныхИсточник.Параметр = СтрокаИсточник.Параметр;
			КонецЦикла;
		КонецЦикла;
		НомерГруппировкиДоРекламы = -2;
	ИначеЕсли НомерГруппировкиДоСегмента = -1 И ВыводитьСегменты Тогда
		// добавляем все сегменты
		Для каждого ЭлементСегмент Из ТЗ_Сегменты Цикл
			СтрокаДанныхСегмент = СтрокиДанных.Добавить();
			СтрокаДанныхСегмент.Параметр = ЭлементСегмент.Значение;
		КонецЦикла;
		НомерГруппировкиДоСегмента = -2;
	КонецЕсли;
			
	Пока Выборка.Следующий() Цикл
		Параметр = Выборка[ИмяГруппировки];
		//Если Уровень = НомерГруппировкиСреднее Тогда
		//	ПредстПериода = Формат(Выборка.НачалоПериода, "ДФ=dd_MM_yyyy");
		//Иначе	
			ПредстПериода = Формат(Выборка.Период, "ДФ=dd_MM_yyyy");
		//КонецЕсли;
				
		//Если Уровень = НомерГруппировкиСреднее Тогда
		//	СтрокиДанных.Родитель["НачПериодаКолво_" + ПредстПериода] = Выборка.Колво;
		//	Родитель = СтрокиДанных.Родитель.Родитель;
		//	Пока Родитель <> Неопределено Цикл
		//		Родитель["НачПериодаКолво_" + ПредстПериода] = Родитель.Строки.Итог("НачПериодаКолво_" + ПредстПериода);
		//		Родитель = Родитель.Родитель;
		//	КонецЦикла;	
		//	
		//	ВыборкаНиже = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//	ДобавитьВеткуВДеревоДанныхНаСервере(ВыборкаНиже, СтрокиДанных);
		//Иначе
			Если Уровень = НомерГруппировкиПериода Тогда
			СтрокиДанных.Родитель["Колво_" + ПредстПериода] = Выборка.Колво;
			Родитель = СтрокиДанных.Родитель.Родитель;
			Пока Родитель <> Неопределено Цикл
				Родитель["Колво_" + ПредстПериода] = Родитель.Строки.Итог("Колво_" + ПредстПериода);
				Родитель = Родитель.Родитель;
			КонецЦикла;	
		Иначе	
			СтрокаДанные = СтрокиДанных.Найти(Параметр,"Параметр");
			Если СтрокаДанные = Неопределено Тогда
				СтрокаДанные = СтрокиДанных.Добавить();
			КонецЕсли;	
			СтрокаДанные.Параметр = Параметр;
			
			
			Если ВыводитьРегионы И Уровень = НомерГруппировкиДоРегиона Тогда
				// добавляем все регионы
				Для каждого ЭлементРегион Из СЗ_Регионы Цикл
					СтрокаДанныхРегион = СтрокаДанные.Строки.Добавить();
					СтрокаДанныхРегион.Параметр = ЭлементРегион.Значение;
				КонецЦикла;
			ИначеЕсли ВыводитьРекламу И Уровень = НомерГруппировкиДоРекламы Тогда
				// добавляем все рекламы
				Для каждого СтрокаКанал Из ДЗ_Реклама.ПолучитьЭлементы() Цикл
					СтрокаДанныхКанал = СтрокаДанные.Строки.Добавить();
					СтрокаДанныхКанал.Параметр = СтрокаКанал.Параметр;
					Для каждого СтрокаИсточник Из СтрокаКанал.ПолучитьЭлементы() Цикл
						СтрокаДанныхИсточник = СтрокаДанныхКанал.Строки.Добавить();
						СтрокаДанныхИсточник.Параметр = СтрокаИсточник.Параметр;
					КонецЦикла;	
				КонецЦикла;
			ИначеЕсли ВыводитьСегменты И Уровень = НомерГруппировкиДоСегмента Тогда
				// добавляем все сегменты
				Массив_Сегменты = ТЗ_Сегменты.НайтиСтроки(Новый Структура("Подразделение",Выборка.Подразделения));
				Для каждого СтрокаСегмент Из Массив_Сегменты Цикл
					СтрокаДанныхСегмент = СтрокаДанные.Строки.Добавить();
					СтрокаДанныхСегмент.Параметр = СтрокаСегмент.Сегмент;
				КонецЦикла;
				
			КонецЕсли;	
		
			ВыборкаНиже = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаНиже.Количество() > 0 Тогда
				ДобавитьВеткуВДеревоДанныхНаСервере(ВыборкаНиже, СтрокаДанные.Строки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры//ДобавитьВеткуВДеревоДанныхНаСервере(Выборка, СтрокиДанных);

&НаСервере
Процедура ВывестиВТабличныйДокументНаСервере(ВыводимыеСтроки, Колонки, Уровень, КолвоИтого)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("Макет");
	
	ОблГ_Параметр = Макет.ПолучитьОбласть("Группировка" + Уровень + "|Параметр");
	ОблГ_Период = Макет.ПолучитьОбласть("Группировка" + Уровень + "|Период");
	ОблГ_Среднее = Макет.ПолучитьОбласть("Группировка" + Уровень + "|СреднееЗаПериод");
	ОблГ_Всего = Макет.ПолучитьОбласть("Группировка" + Уровень + "|ВсегоЗаПериод");
	
	Для каждого СтрокаТЧ из ВыводимыеСтроки Цикл
		Если СтрокаТЧ.Параметр = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КолвоПериодов = 0;
		КолвоЗаПериод = 0;
		ПериодовВсего = 0;
		
		
		// не выводим итогов по каналам
		ЭтоКанал = ТипЗнч(СтрокаТЧ.Параметр) = Тип("ПланВидовХарактеристикСсылка.КаналыРекламныхВоздействий") ИЛИ СтрокаТЧ.Параметр = "<<канал не указан>>";
		
		//СуммаЗаПериод = 0;
		КолвоВсего = 0;
		Для каждого Колонка Из Колонки Цикл
			Если Колонка.Имя = "Параметр" Тогда
				ОблГ_Параметр.Параметры.Группировка = СтрокаТЧ.Параметр;
				Область = ТабличныйДокумент.Вывести(ОблГ_Параметр, Уровень);
				Область.АвтоОтступ = Уровень;
			ИначеЕсли Найти(Колонка.Имя,"НачПериодаКолво") > 0 Тогда
				//Колво = 0;
				Если ЭтоКанал Тогда
					КолвоЗаПериод = 0;
				//ИначеЕсли СтрокаТЧ[Колонка.Имя] <> Неопределено Тогда
				//	Колво = Окр(СтрокаТЧ[Колонка.Имя], 2);
				КонецЕсли;	
				//ОблГ_Среднее.Параметры.Колво = Колво;
				ОблГ_Среднее.Параметры.Среднее = Окр(КолвоЗаПериод / КолвоПериодов, 2);
				ТабличныйДокумент.Присоединить(ОблГ_Среднее);
				КолвоПериодов = 0;
				КолвоЗаПериод = 0;
			ИначеЕсли Найти(Колонка.Имя,"Колво") > 0 И Найти(Колонка.Имя,"НачПериода") = 0 Тогда
				Колво = 0;
				Если ЭтоКанал Тогда
				ИначеЕсли СтрокаТЧ[Колонка.Имя] <> Неопределено Тогда
					Колво = Окр(СтрокаТЧ[Колонка.Имя], 2);
				КонецЕсли;	
				ОблГ_Период.Параметры.Колво = Колво;
				ТабличныйДокумент.Присоединить(ОблГ_Период);
				КолвоПериодов = КолвоПериодов + 1;
				ПериодовВсего = ПериодовВсего + 1;
				КолвоЗаПериод = КолвоЗаПериод + Колво;
				КолвоВсего = КолвоВсего + Колво;
			ИначеЕсли Найти(Колонка.Имя,"Колво") > 0 И Найти(Колонка.Имя,"НачПериода") = 0 Тогда
				Колво = 0;
				Если ЭтоКанал Тогда
				ИначеЕсли СтрокаТЧ[Колонка.Имя] <> Неопределено Тогда
					Колво = СтрокаТЧ[Колонка.Имя];
				КонецЕсли;	
				КолвоВсего = КолвоВсего + Колво;	
			КонецЕсли;	
		КонецЦикла;
		
		Если ЭтоКанал Тогда
		ИначеЕсли СтрокаТЧ[Колонка.Имя] <> Неопределено Тогда
			ОблГ_Всего.Параметры.Колво = КолвоВсего;
			//ОблГ_Всего.Параметры.Среднее = Окр(КолвоВсего / ПериодовВсего,2);
		КонецЕсли;
				
		ТабличныйДокумент.Присоединить(ОблГ_Всего);
		Если СтрокаТЧ.Строки.Количество() > 0 Тогда
			ВывестиВТабличныйДокументНаСервере(СтрокаТЧ.Строки, Колонки, Уровень + 1, КолвоИтого);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры//ВывестиВТабличныйДокументНаСервере

&НаСервере
Процедура СформироватьНаСервере()
	
	//Если НЕ ЗначениеЗаполнено(Календарь) Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Поле = "Календарь";
	//	Сообщение.Текст = "Укажите календарь!";
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;	
	//
	//ЗапросКалендарь = Новый Запрос;
	//ЗапросКалендарь.Текст =
	//"ВЫБРАТЬ
	//|	КалендарныеГрафики.ДатаГрафика
	//|ИЗ
	//|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	//|ГДЕ
	//|	КалендарныеГрафики.ДеньВключенВГрафик
	//|	И КалендарныеГрафики.ДатаГрафика МЕЖДУ &НачДата И &КонДата
	//|	И КалендарныеГрафики.Календарь = &Календарь";
	//ЗапросКалендарь.УстановитьПараметр("НачДата", НачДата);
	//ЗапросКалендарь.УстановитьПараметр("КонДата", КонецДня(КонДата));
	//ЗапросКалендарь.УстановитьПараметр("Календарь", Календарь);
	
	//ВыборкаДни = ЗапросКалендарь.Выполнить().Выбрать();
	//Если ВыборкаДни.Количество() = 0 Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Поле = "Календарь";
	//	Сообщение.Текст = "В календаре не найдено рабочих дней за выбранный период!";
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	
	УдалитьПустыеЗначения(ОтборПодразделения);
	УдалитьПустыеЗначения(ОтборМенеджеры);
	
	ТЗ_Данные = Новый ТаблицаЗначений;
	ТЗ_Данные.Колонки.Добавить("Параметр");
	ТЗ_Данные.Колонки.Добавить("Сортировка");
	ТЗ_Данные.Колонки.Добавить("Итог");
	
	ВыводитьСегменты = Группировки.НайтиПоЗначению("Сегменты").Пометка;	
	Если ВыводитьСегменты Тогда
		ТЗ_Сегменты.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СегментыНоменклатуры.Ссылка КАК Сегмент
		|ИЗ
		|	Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
		|ГДЕ
		|	(НЕ СегментыНоменклатуры.ПометкаУдаления)
		|	И (НЕ СегментыНоменклатуры.ЭтоГруппа)
		|	И СегментыНоменклатуры.Подразделение = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
		
		ВыборкаОбщСегменты = Запрос.Выполнить().Выбрать();
		
		ЗапросСегменты = Новый Запрос;
		ЗапросСегменты.Текст =
		"ВЫБРАТЬ
		|	СегментыНоменклатуры.Ссылка КАК Сегмент,
		|	СтруктураПредприятия.Ссылка КАК Подразделение
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
		|		ПО (СегментыНоменклатуры.Подразделение = СтруктураПредприятия.Ссылка
		|				И (НЕ СегментыНоменклатуры.ПометкаУдаления)
		|				И (НЕ СегментыНоменклатуры.ЭтоГруппа))
		|ГДЕ
		|	(НЕ СтруктураПредприятия.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Подразделение
		|АВТОУПОРЯДОЧИВАНИЕ";
		Подр = Неопределено;
		Выборка = ЗапросСегменты.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Сегмент = Null Тогда
				Продолжить;
			КонецЕсли;	
			СтрокаСегмент = ТЗ_Сегменты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСегмент, Выборка);
			
			//Если Подр <> Выборка.Подразделение Тогда
			//	СтрокаСегмент = ТЗ_Сегменты.Добавить();
			//	СтрокаСегмент.Сегмент = "<<вне сегмента>>";
			//	СтрокаСегмент.Подразделение = Выборка.Подразделение;
			//	ВыборкаОбщСегменты.Сбросить();
			//	Пока ВыборкаОбщСегменты.Следующий() Цикл
			//		СтрокаСегмент = ТЗ_Сегменты.Добавить();
			//		СтрокаСегмент.Сегмент = ВыборкаОбщСегменты.Сегмент;
			//		СтрокаСегмент.Подразделение = Выборка.Подразделение;
			//	КонецЦикла;	
			//КонецЕсли;
			//Подр = Выборка.Подразделение;
		КонецЦикла;	
	КонецЕсли;
	
	ВыводитьРекламу = Группировки.НайтиПоЗначению("Реклама").Пометка;	
	Если ВыводитьРекламу Тогда
		// соберем все маркетинговые мероприятия
		ДЗ_Реклама.ПолучитьЭлементы().Очистить();
		ЗапросРеклама = Новый Запрос;
		ЗапросРеклама.Текст =
		"ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Источник,
		|	МаркетинговыеМероприятия.Владелец КАК Канал
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	(НЕ МаркетинговыеМероприятия.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Канал,
		|	МаркетинговыеМероприятия.Наименование
		|ИТОГИ ПО
		|	Канал,
		|	Источник";
		ВыборкаКанал = ЗапросРеклама.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКанал.Следующий() Цикл
			СтрокаКанал = ДЗ_Реклама.ПолучитьЭлементы().Добавить();
			СтрокаКанал.Параметр = ВыборкаКанал.Канал;
			ВыборкаИсточник = ВыборкаКанал.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаИсточник.Следующий() Цикл
				СтрокаИсточник = СтрокаКанал.ПолучитьЭлементы().Добавить();
				СтрокаИсточник.Параметр = ВыборкаИсточник.Источник;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;

	ВыводитьРегионы = Группировки.НайтиПоЗначению("Регионы").Пометка;	
	Если ВыводитьРегионы Тогда
		// соберем все регионы
		СЗ_Регионы.Очистить();
		ЗапросРегионы = Новый Запрос;
		ЗапросРегионы.Текст =
		"ВЫБРАТЬ
		|	БизнесРегионы.Ссылка КАК Регион
		|ИЗ
		|	Справочник.БизнесРегионы КАК БизнесРегионы
		|ГДЕ
		|	(НЕ БизнесРегионы.ПометкаУдаления)";
		ВыборкаРегион = ЗапросРегионы.Выполнить().Выбрать();
		Пока ВыборкаРегион.Следующий() Цикл
			СЗ_Регионы.Добавить(ВыборкаРегион.Регион);
		КонецЦикла;	
	КонецЕсли;

	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеЧисло = Новый ОписаниеТипов(Массив);
	
	Если Периодичность = "ПоДням" Тогда
		//КонДата = КонецНедели(КонДата);
	ИначеЕсли Периодичность = "ПоНеделям" Тогда
		НачДата = НачалоНедели(НачДата);
		КонДата = КонецНедели(КонДата);
	ИначеЕсли Периодичность = "ПоМесяцам" Тогда
		НачДата = НачалоМесяца(НачДата);
		КонДата = КонецМесяца(КонДата);
	КонецЕсли;
	
	ДеревоДанных = Новый ДеревоЗначений;
	ДеревоДанных.Колонки.Добавить("Параметр");
	
	ТекДень = НачДата;
	КолвоПериодов = 0;
	Пока ТекДень <= КонДата Цикл
		Если Периодичность = "ПоДням" Тогда
			ДеревоДанных.Колонки.Добавить("Колво_" + Формат(ТекДень, "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			
			Если ДеньНедели(ТекДень) = 7 ИЛИ ТекДень = КонДата Тогда
				ДеревоДанных.Колонки.Добавить("НачПериодаКолво_" + Формат(НачалоНедели(ТекДень), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			КонецЕсли;	
			ТекДень = НачалоДня(ТекДень + 24 * 60 * 60);
		ИначеЕсли Периодичность = "ПоНеделям" Тогда
			
			ДеревоДанных.Колонки.Добавить("Колво_" + Формат(НачалоНедели(ТекДень), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			
			Если КонецНедели(ТекДень) >= КонецМесяца(Макс(НачалоНедели(ТекДень),НачДата)) ИЛИ КонецНедели(ТекДень) = КонецНедели(КонДата) Тогда
				ДеревоДанных.Колонки.Добавить("НачПериодаКолво_" + Формат(НачалоМесяца(Макс(НачалоНедели(ТекДень),НачДата)), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			КонецЕсли;
			
			ТекДень = НачалоНедели(ТекДень + 7 * 24 * 60 * 60);
			
		ИначеЕсли Периодичность = "ПоМесяцам" Тогда
			ДеревоДанных.Колонки.Добавить("Колво_" + Формат(НачалоМесяца(ТекДень), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			
			Если КонецМесяца(ТекДень) >= КонецГода(Макс(НачалоМесяца(ТекДень),НачДата)) ИЛИ КонецМесяца(ТекДень) = КонецМесяца(КонДата) Тогда
				ДеревоДанных.Колонки.Добавить("НачПериодаКолво_" + Формат(НачалоГода(Макс(НачалоМесяца(ТекДень),НачДата)), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			КонецЕсли;
			
			ТекДень = НачалоМесяца(ТекДень + 31 * 24 * 60 * 60);
		КонецЕсли;
		
	КонецЦикла;
	
	СЗ_СуммируемыеПоляПриЗаполнении.Очистить();
	
	Для каждого Колонка из ДеревоДанных.Колонки Цикл
		Если Колонка.Имя = "Параметр" Тогда
			Продолжить;
		КонецЕсли;	
		СЗ_СуммируемыеПоляПриЗаполнении.Добавить(Колонка.Имя);
	КонецЦикла;
	
	СтрокаИтого = ДеревоДанных.Строки.Добавить();
	
	КолвоГрупп = 0;
	ТекстГруппировокВыбрать = "";
	
	ТекстГруппировокВыбратьНеУказан = "";  //Асист KS
	
	ТекстГруппировокИтоги = "";
	СтрПараметры = "";
	НомерГруппировкиДоРекламы = -1;
	НомерГруппировкиДоРегиона = -1;
	НомерГруппировкиДоСегмента = -1;
	Отступ = "";
	
	СЗ_Группировки.Очистить();
	
	Если НЕ ВыводитьСегменты Тогда
		//ТекстПериода = "НАЧАЛОПЕРИОДА(ИсточникиПервичногоИнтереса.Сделка.ДатаНачала, НЕДЕЛЯ) КАК НачалоПериода,
		ТекстПериода = "	НАЧАЛОПЕРИОДА(ИсточникиПервичногоИнтереса.Сделка.ДатаНачала, День) КАК Период,";
		ТекстПериодаНеУказан = "	НАЧАЛОПЕРИОДА(Сделки.ДатаНачала, День) КАК Период,"; //Асист KS
		
		Если Периодичность = "ПоНеделям" Тогда
			//ТекстПериода = "НАЧАЛОПЕРИОДА(ИсточникиПервичногоИнтереса.Сделка.ДатаНачала, Месяц) КАК НачалоПериода,
			ТекстПериода = "	НАЧАЛОПЕРИОДА(ИсточникиПервичногоИнтереса.Сделка.ДатаНачала, Неделя) КАК Период,";
			ТекстПериодаНеУказан = "	НАЧАЛОПЕРИОДА(Сделки.ДатаНачала, Неделя) КАК Период,"; //Асист KS
			
		ИначеЕсли Периодичность = "ПоМесяцам" Тогда
			//ТекстПериода = "НАЧАЛОПЕРИОДА(ИсточникиПервичногоИнтереса.Сделка.ДатаНачала, Год) КАК НачалоПериода,
			ТекстПериода = "	НАЧАЛОПЕРИОДА(ИсточникиПервичногоИнтереса.Сделка.ДатаНачала, Месяц) КАК Период,";
			ТекстПериодаНеУказан = "	НАЧАЛОПЕРИОДА(Сделки.ДатаНачала, Месяц) КАК Период,"; //Асист KS
			
		КонецЕсли;
		
		
		Для каждого ЭлементГрупп Из Группировки Цикл
			Если ЭлементГрупп.Пометка Тогда
				КолвоГрупп = КолвоГрупп + 1;
				
				СтрПараметры = СтрПараметры + ?(СтрПараметры = "", "", Символы.ПС) + Отступ + СокрЛП(ЭлементГрупп.Значение);
				
				Если ЭлементГрупп.Значение = "Подразделения" Тогда
					ТекстГруппировокВыбрать = ТекстГруппировокВыбрать + Символы.ПС + "ИсточникиПервичногоИнтереса.Сделка.Ответственный.Подразделение КАК Подразделения,";
					ТекстГруппировокВыбратьНеУказан = ТекстГруппировокВыбратьНеУказан + Символы.ПС + "Сделки.Ответственный.Подразделение,";//Асист KS
					ТекстГруппировокИтоги = ТекстГруппировокИтоги + Символы.ПС + "	Подразделения,";
					СЗ_Группировки.Добавить(ЭлементГрупп.Значение);
				ИначеЕсли ЭлементГрупп.Значение = "Менеджеры" Тогда
					ТекстГруппировокВыбрать = ТекстГруппировокВыбрать + Символы.ПС + "ИсточникиПервичногоИнтереса.Сделка.Ответственный КАК Менеджеры,";
					ТекстГруппировокВыбратьНеУказан = ТекстГруппировокВыбратьНеУказан + Символы.ПС + "Сделки.Ответственный,";//Асист KS
					ТекстГруппировокИтоги = ТекстГруппировокИтоги + Символы.ПС + "	Менеджеры,";
					СЗ_Группировки.Добавить(ЭлементГрупп.Значение);
				ИначеЕсли ЭлементГрупп.Значение = "Регионы" Тогда
					ТекстГруппировокВыбрать = ТекстГруппировокВыбрать + Символы.ПС + "ИсточникиПервичногоИнтереса.Сделка.БизнесРегион КАК Регионы,";	
					ТекстГруппировокВыбратьНеУказан = ТекстГруппировокВыбратьНеУказан + Символы.ПС + "Сделки.БизнесРегион,";//Асист KS
					ТекстГруппировокИтоги = ТекстГруппировокИтоги + Символы.ПС + "	Регионы,";
					НомерГруппировкиДоРегиона = КолвоГрупп - 2;
					СЗ_Группировки.Добавить(ЭлементГрупп.Значение);
				ИначеЕсли ЭлементГрупп.Значение = "Реклама" Тогда
					
					ТекстГруппировокВыбрать = ТекстГруппировокВыбрать + Символы.ПС 
					+ "ИсточникиПервичногоИнтереса.КаналПервичногоИнтереса КАК Канал,
					|	Выразить(ИсточникиПервичногоИнтереса.ИсточникПервичногоИнтереса КАК Справочник.МаркетинговыеМероприятия) КАК Источник,";		
					ТекстГруппировокВыбратьНеУказан = ТекстГруппировокВыбратьНеУказан + Символы.ПС
					+ " ""Не указано"",
					|	""Не указано"",";//Асист KS		

					ТекстГруппировокИтоги = ТекстГруппировокИтоги + Символы.ПС + "	Канал,
					| Источник,";						
					НомерГруппировкиДоРекламы = КолвоГрупп - 2;						
					НомерГруппировкиКанал = КолвоГрупп - 1;						
					НомерГруппировкиИсточник = КолвоГрупп;
					КолвоГрупп = КолвоГрупп + 1;
					
					СЗ_Группировки.Добавить("Канал");
					СЗ_Группировки.Добавить("Источник");
				КонецЕсли;	
				Отступ = Отступ + " ";
				
			КонецЕсли;	
		КонецЦикла;	
		
		//НомерГруппировкиПериода = КолвоГрупп + 1;
		НомерГруппировкиПериода = КолвоГрупп;
		НомерГруппировкиСреднее = КолвоГрупп;
		КолвоГрупп = КолвоГрупп + 2;//добавляем группировки периодов
		
		ЗапросСделки = Новый Запрос;
		
		ТекстУсловия = "";
		ТекстУсловияНеУказан = "";//Асист KS
		
		Если ВидОтбораМенеджеры = "ВСписке" Тогда
			ТекстУсловия = ТекстУсловия + "
			|	И ИсточникиПервичногоИнтереса.Сделка.Ответственный В(&СписокМенеджеров)";
			ТекстУсловияНеУказан = ТекстУсловияНеУказан + "
			|	И Сделки.Ответственный В(&СписокМенеджеров)"; //Асист KS
			ЗапросСделки.УстановитьПараметр("СписокМенеджеров", ОтборМенеджеры);
		ИначеЕсли ВидОтбораМенеджеры = "НеВСписке" Тогда
			ТекстУсловия = ТекстУсловия + "
			|	И (НЕ ИсточникиПервичногоИнтереса.Сделка.Ответственный В(&СписокМенеджеров))";
			ТекстУсловияНеУказан = ТекстУсловияНеУказан + "
			|	И (НЕ Сделки.Ответственный В(&СписокМенеджеров))"; //Асист KS

			ЗапросСделки.УстановитьПараметр("СписокМенеджеров", ОтборМенеджеры);
		КонецЕсли;
		
		Если ВидОтбораПодразделения = "ВСписке" Тогда
			ТекстУсловия = ТекстУсловия + "
			|	И ИсточникиПервичногоИнтереса.Сделка.Ответственный.Подразделение В(&СписокПодразделений)";
			ТекстУсловияНеУказан = ТекстУсловияНеУказан + "
			|	И Сделки.Ответственный.Подразделение В(&СписокПодразделений)"; //Асист KS

			ЗапросСделки.УстановитьПараметр("СписокПодразделений", ОтборПодразделения);
		ИначеЕсли ВидОтбораПодразделения = "НеВСписке" Тогда
			ТекстУсловия = ТекстУсловия + "
			|	И (НЕ ИсточникиПервичногоИнтереса.Сделка.Ответственный.Подразделение В(&СписокПодразделений))";
			ТекстУсловияНеУказан = ТекстУсловияНеУказан + "
			|	И (НЕ Сделки.Ответственный.Подразделение В(&СписокПодразделений))"; //Асист KS

			ЗапросСделки.УстановитьПараметр("СписокПодразделений", ОтборПодразделения);
		КонецЕсли;	
		
		ЗапросСделки.Текст =
		"ВЫБРАТЬ " + ТекстГруппировокВыбрать + "
		| " + ТекстПериода + "
		|	ИсточникиПервичногоИнтереса.Сделка КАК Колво
		|ИЗ
		|	РегистрСведений.ИсточникиПервичногоИнтереса КАК ИсточникиПервичногоИнтереса
		|ГДЕ
		|	(НЕ ИсточникиПервичногоИнтереса.Сделка.ПометкаУдаления)
		|	И ИсточникиПервичногоИнтереса.Сделка.ДатаНачала МЕЖДУ &НачДата И &КонДата" + ТекстУсловия + " 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ "+ ТекстГруппировокВыбратьНеУказан + "
		| " + ТекстПериодаНеУказан + "
		|	Сделки.Ссылка
		|ИЗ
		|	Справочник.СделкиСКлиентами КАК Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсточникиПервичногоИнтереса КАК ИсточникиПервичногоИнтереса
		|		ПО Сделки.Ссылка = ИсточникиПервичногоИнтереса.Сделка
		|ГДЕ
		|	НЕ Сделки.ПометкаУдаления
		|	И Сделки.ДатаНачала МЕЖДУ &НачДата И &КонДата
		|	И ИсточникиПервичногоИнтереса.КаналПервичногоИнтереса ЕСТЬ NULL" + ТекстУсловияНеУказан + "
		|ИТОГИ
		|	КОЛИЧЕСТВО(Различные Колво)
		|ПО" + ТекстГруппировокИтоги + "
		//|	НачалоПериода,
		|	Период";
		
		
		//Асист KS реклама
		//"ВЫБРАТЬ
		//|	ИсточникиПервичногоИнтереса.Сделка.Ответственный.Подразделение КАК Подразделения,
		//|	ИсточникиПервичногоИнтереса.КаналПервичногоИнтереса КАК Канал,
		//|	ВЫРАЗИТЬ(ИсточникиПервичногоИнтереса.ИсточникПервичногоИнтереса КАК Справочник.МаркетинговыеМероприятия) КАК Источник,
		//|	НАЧАЛОПЕРИОДА(ИсточникиПервичногоИнтереса.Сделка.ДатаНачала, НЕДЕЛЯ) КАК Период,
		//|	ИсточникиПервичногоИнтереса.Сделка КАК Колво
		//|ИЗ
		//|	РегистрСведений.ИсточникиПервичногоИнтереса КАК ИсточникиПервичногоИнтереса
		//|ГДЕ
		//|	НЕ ИсточникиПервичногоИнтереса.Сделка.ПометкаУдаления
		//|	И ИсточникиПервичногоИнтереса.Сделка.ДатаНачала МЕЖДУ &НачДата И &КонДата
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	Сделки.Ответственный.Подразделение,
		//|	""Не указано"",
		//|	""Не указано"",
		//|	NULL,
		//|	Сделки.Ссылка
		//|ИЗ
		//|	Справочник.СделкиСКлиентами КАК Сделки
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсточникиПервичногоИнтереса КАК ИсточникиПервичногоИнтереса
		//|		ПО Сделки.Ссылка = ИсточникиПервичногоИнтереса.Сделка
		//|ГДЕ
		//|	Сделки.ДатаНачала МЕЖДУ &НачДата И &КонДата
		//|	И ИсточникиПервичногоИнтереса.КаналПервичногоИнтереса ЕСТЬ NULL 
		//|ИТОГИ
		//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Колво)
		//|ПО
		//|	Подразделения,
		//|	Канал,
		//|	Источник,
		//|	Период"

	Иначе
		//ТекстПериода = "НАЧАЛОПЕРИОДА(СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.ДатаНачала, НЕДЕЛЯ) КАК НачалоПериода,
		ТекстПериода = "	НАЧАЛОПЕРИОДА(СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.ДатаНачала, День) КАК Период,";
		
		Если Периодичность = "ПоНеделям" Тогда
			//ТекстПериода = "НАЧАЛОПЕРИОДА(СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.ДатаНачала, Месяц) КАК НачалоПериода,
			ТекстПериода = "	НАЧАЛОПЕРИОДА(СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.ДатаНачала, Неделя) КАК Период,";
		ИначеЕсли Периодичность = "ПоМесяцам" Тогда
			//ТекстПериода = "НАЧАЛОПЕРИОДА(СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.ДатаНачала, Год) КАК НачалоПериода,
			ТекстПериода = "	НАЧАЛОПЕРИОДА(СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.ДатаНачала, Месяц) КАК Период,";
		КонецЕсли;
		
		Для каждого ЭлементГрупп Из Группировки Цикл
			Если ЭлементГрупп.Пометка Тогда
				
				КолвоГрупп = КолвоГрупп + 1;
				
				СтрПараметры = СтрПараметры + ?(СтрПараметры = "", "", Символы.ПС) + Отступ + СокрЛП(ЭлементГрупп.Значение);
				
				Если ЭлементГрупп.Значение = "Подразделения" Тогда
					ТекстГруппировокВыбрать = ТекстГруппировокВыбрать + Символы.ПС + "СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.Ответственный.Подразделение КАК Подразделения,";
					ТекстГруппировокИтоги = ТекстГруппировокИтоги + Символы.ПС + "	Подразделения,";
					СЗ_Группировки.Добавить(ЭлементГрупп.Значение);
				ИначеЕсли ЭлементГрупп.Значение = "Менеджеры" Тогда
					ТекстГруппировокВыбрать = ТекстГруппировокВыбрать + Символы.ПС + "СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.Ответственный КАК Менеджеры,";
					ТекстГруппировокИтоги = ТекстГруппировокИтоги + Символы.ПС + "	Менеджеры,";
					СЗ_Группировки.Добавить(ЭлементГрупп.Значение);
				ИначеЕсли ЭлементГрупп.Значение = "Сегменты" Тогда
					ТекстГруппировокВыбрать = ТекстГруппировокВыбрать + Символы.ПС + "СделкиСКлиентамиИнтересПоСегментамНоменклатуры.СегментНоменклатуры КАК Сегменты,";	
					ТекстГруппировокИтоги = ТекстГруппировокИтоги + Символы.ПС + "	Сегменты,";
					НомерГруппировкиДоСегмента = КолвоГрупп - 2;	
					СЗ_Группировки.Добавить(ЭлементГрупп.Значение);
				ИначеЕсли ЭлементГрупп.Значение = "Регионы" Тогда
					ТекстГруппировокВыбрать = ТекстГруппировокВыбрать + Символы.ПС + "СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.БизнесРегион КАК Регионы,";	
					ТекстГруппировокИтоги = ТекстГруппировокИтоги + Символы.ПС + "	Регионы,";
					НомерГруппировкиДоРегиона = КолвоГрупп - 2;
					СЗ_Группировки.Добавить(ЭлементГрупп.Значение);
				ИначеЕсли ЭлементГрупп.Значение = "Реклама" Тогда
					
					ТекстГруппировокВыбрать = ТекстГруппировокВыбрать + Символы.ПС 
					+ "ИсточникиПервичногоИнтереса.КаналПервичногоИнтереса КАК Канал,
					|	Выразить(ИсточникиПервичногоИнтереса.ИсточникПервичногоИнтереса КАК Справочник.МаркетинговыеМероприятия) КАК Источник,";		
					ТекстГруппировокИтоги = ТекстГруппировокИтоги + Символы.ПС + "	Канал,
					| Источник,";						
					НомерГруппировкиДоРекламы = КолвоГрупп - 2;						
					НомерГруппировкиКанал = КолвоГрупп - 1;						
					НомерГруппировкиИсточник = КолвоГрупп;
					КолвоГрупп = КолвоГрупп + 1;
					
					СЗ_Группировки.Добавить("Канал");
					СЗ_Группировки.Добавить("Источник");
				КонецЕсли;	
				Отступ = Отступ + " ";
				
			КонецЕсли;	
		КонецЦикла;	
		
		//НомерГруппировкиПериода = КолвоГрупп + 1;
		НомерГруппировкиПериода = КолвоГрупп;
		НомерГруппировкиСреднее = КолвоГрупп;
		КолвоГрупп = КолвоГрупп + 2;//добавляем группировки периодов
		
		ЗапросСделки = Новый Запрос;
		
		ТекстУсловия = "";
		Если ВидОтбораМенеджеры = "ВСписке" Тогда
			ТекстУсловия = ТекстУсловия + "
			|	И СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.Ответственный В(&СписокМенеджеров)";
			ЗапросСделки.УстановитьПараметр("СписокМенеджеров", ОтборМенеджеры);
		ИначеЕсли ВидОтбораМенеджеры = "НеВСписке" Тогда
			ТекстУсловия = ТекстУсловия + "
			|	И (НЕ СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.Ответственный В(&СписокМенеджеров))";
			ЗапросСделки.УстановитьПараметр("СписокМенеджеров", ОтборМенеджеры);
		КонецЕсли;
		
		Если ВидОтбораПодразделения = "ВСписке" Тогда
			ТекстУсловия = ТекстУсловия + "
			|	И СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.Ответственный.Подразделение В(&СписокПодразделений)";
			ЗапросСделки.УстановитьПараметр("СписокПодразделений", ОтборПодразделения);
		ИначеЕсли ВидОтбораПодразделения = "НеВСписке" Тогда
			ТекстУсловия = ТекстУсловия + "
			|	И (НЕ СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.Ответственный.Подразделение В(&СписокПодразделений))";
			ЗапросСделки.УстановитьПараметр("СписокПодразделений", ОтборПодразделения);
		КонецЕсли;
		
		ЗапросСделки.Текст =
		"ВЫБРАТЬ" + ТекстГруппировокВыбрать + "
		| " + ТекстПериода + "
		|	СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка КАК Колво
		|ИЗ
		|	Справочник.СделкиСКлиентами.ИнтересПоСегментамНоменклатуры КАК СделкиСКлиентамиИнтересПоСегментамНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсточникиПервичногоИнтереса КАК ИсточникиПервичногоИнтереса
		|		ПО СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка = ИсточникиПервичногоИнтереса.Сделка
		|ГДЕ
		|	(НЕ СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.ПометкаУдаления)
		|	И СделкиСКлиентамиИнтересПоСегментамНоменклатуры.Ссылка.ДатаНачала МЕЖДУ &НачДата И &КонДата" + ТекстУсловия + "
		|ИТОГИ
		|	КОЛИЧЕСТВО(Различные Колво)
		|ПО" + ТекстГруппировокИтоги + "
		//|	НачалоПериода,
		|	Период";
		
	КонецЕсли;	
	
	//СЗ_Группировки.Добавить("НачалоПериода");
	СЗ_Группировки.Добавить("Период");
	
	ЗапросСделки.УстановитьПараметр("НачДата", НачДата);
	ЗапросСделки.УстановитьПараметр("КонДата", КонецДня(КонДата));
	
	
	Выборка = ЗапросСделки.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДобавитьВеткуВДеревоДанныхНаСервере(Выборка, СтрокаИтого.Строки);
	
	КолвоИтого = 0;
	КолвоЗаПериод = 0;
	Для каждого ЭлементСуммКолонка Из СЗ_СуммируемыеПоляПриЗаполнении Цикл
		ИмяКолонки = ЭлементСуммКолонка.Значение;
		
		СтрокаИтого[ИмяКолонки] = СтрокаИтого.Строки.Итог(ИмяКолонки);
		
		Если Найти(ИмяКолонки, "НачПериода") = 0 Тогда
			КолвоЗаПериод = КолвоЗаПериод + СтрокаИтого[ИмяКолонки];
		Иначе
			СтрокаИтого[ИмяКолонки] = КолвоЗаПериод;
			КолвоЗаПериод = 0;
		КонецЕсли;
		
		Если Найти(ИмяКолонки, "Колво") > 0 И Найти(ИмяКолонки, "НачПериода") = 0 Тогда
			КолвоИтого = КолвоИтого + СтрокаИтого[ИмяКолонки];
		КонецЕсли;
		
		Если СтрокаИтого[ИмяКолонки] = 0 Тогда
			ДеревоДанных.Колонки.Удалить(ДеревоДанных.Колонки.Индекс(ДеревоДанных.Колонки.Найти(ИмяКолонки)));
		КонецЕсли;	
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("Макет");
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблШ_Параметр = Макет.ПолучитьОбласть("ШапкаТаблицы|Параметр");
	ОблШ_Период = Макет.ПолучитьОбласть("ШапкаТаблицы|Период");
	ОблШ_Среднее = Макет.ПолучитьОбласть("ШапкаТаблицы|СреднееЗаПериод");
	ОблШ_Итого = Макет.ПолучитьОбласть("ШапкаТаблицы|ВсегоЗаПериод");
	
	ОблЗаголовок.Параметры.Заголовок = "Отчет по обращениям клиентов по рекламе за " + ПредставлениеПериода(НачДата, КонецДня(КонДата), "ФП=истина"); 
	ТабличныйДокумент.Вывести(ОблЗаголовок);
	
	ОблШ_Параметр.Параметры.СтрПараметры = СтрПараметры;
	ТабличныйДокумент.Вывести(ОблШ_Параметр);
	
	
	Для каждого Колонка Из ДеревоДанных.Колонки Цикл
		
		Если Найти(Колонка.Имя, "НачПериодаКолво") > 0 Тогда
			//Дата = СтрЗаменить(Прав(Колонка.Имя, 10),"_",".");
			//Год = Число(Прав(Дата, 4));
			//Месяц = Число(Сред(Дата, 4, 2));
			//День = Число(Сред(Дата, 1, 2));
			//Дата = Дата(Год,Месяц,День);
			//Если Периодичность = "ПоДням" Тогда
			//	ОблШ_Среднее.Параметры.Период = "нед." + Формат(НачалоНедели(Дата), "ДФ=dd.MM.yyyy") + "-" + Формат(Мин(КонецНедели(Дата), КонДата), "ДФ=dd.MM.yyyy");
			//ИначеЕсли Периодичность = "ПоНеделям" Тогда
			//	ОблШ_Среднее.Параметры.Период = ПредставлениеПериода(НачалоМесяца(Дата), КонецМесяца(Дата), "ФП=истина");
			//ИначеЕсли Периодичность = "ПоМесяцам" Тогда
			//	ОблШ_Среднее.Параметры.Период = СокрЛП(Год) + " г.";
			//КонецЕсли;	
			ТабличныйДокумент.Присоединить(ОблШ_Среднее);
		ИначеЕсли Найти(Колонка.Имя, "Колво") > 0 Тогда	
			Дата = СтрЗаменить(Прав(Колонка.Имя, 10),"_",".");
			Год = Число(Прав(Дата, 4));
			Месяц = Число(Сред(Дата, 4, 2));
			День = Число(Сред(Дата, 1, 2));
			Дата = Дата(Год,Месяц,День);
			Если Периодичность = "ПоДням" Тогда
				ОблШ_Период.Параметры.Период = Формат(Дата, "ДФ=dd.MM.yyyy");
			ИначеЕсли Периодичность = "ПоНеделям" Тогда
				ОблШ_Период.Параметры.Период = "нед." + Формат(НачалоНедели(Дата), "ДФ=dd.MM.yyyy") + "-" + Формат(Мин(КонецНедели(Дата), КонДата), "ДФ=dd.MM.yyyy");
			ИначеЕсли Периодичность = "ПоМесяцам" Тогда
				ОблШ_Период.Параметры.Период = ПредставлениеПериода(НачалоМесяца(Дата), КонецМесяца(Дата), "ФП=истина");	
			КонецЕсли;
			ТабличныйДокумент.Присоединить(ОблШ_Период);
		КонецЕсли;	
			
	КонецЦикла;
	ТабличныйДокумент.Присоединить(ОблШ_Итого);	
	
	ТабличныйДокумент.ФиксацияСверху = 3;
	ТабличныйДокумент.ФиксацияСлева = 1;
	
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	Уровень = 0;
	ВывестиВТабличныйДокументНаСервере(СтрокаИтого.Строки, ДеревоДанных.Колонки, Уровень, КолвоИтого);
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	ОблП_Параметр = Макет.ПолучитьОбласть("Подвал|Параметр");
	ОблП_Период = Макет.ПолучитьОбласть("Подвал|Период");
	ОблП_Среднее = Макет.ПолучитьОбласть("Подвал|СреднееЗаПериод");
	ОблП_Итого = Макет.ПолучитьОбласть("Подвал|ВсегоЗаПериод");
	
	ТабличныйДокумент.Вывести(ОблП_Параметр);
	
	КолвоПериодов = 0;
	КолвоЗаПериод = 0;
	ПериодовВсего = 0;	
	Для каждого Колонка Из ДеревоДанных.Колонки Цикл
		
		Если Найти(Колонка.Имя, "НачПериодаКолво") > 0 Тогда
			//ОблП_Среднее.Параметры.Колво = ДеревоДанных.Строки.Итог(Колонка.Имя);
			ОблП_Среднее.Параметры.Среднее = ДеревоДанных.Строки.Итог(Колонка.Имя) / КолвоПериодов;
			ТабличныйДокумент.Присоединить(ОблП_Среднее);
			КолвоПериодов = 0;
		ИначеЕсли Найти(Колонка.Имя, "Колво") > 0 Тогда	
			ОблП_Период.Параметры.Колво = ДеревоДанных.Строки.Итог(Колонка.Имя);
			ТабличныйДокумент.Присоединить(ОблП_Период);
			КолвоПериодов = КолвоПериодов + 1;
			КолвоЗаПериод = КолвоЗаПериод + ОблП_Период.Параметры.Колво;
			ПериодовВсего = ПериодовВсего + 1;	
		КонецЕсли;	
	КонецЦикла;
		
	ОблП_Итого.Параметры.Колво = КолвоЗаПериод;
	//ОблП_Итого.Параметры.Среднее = КолвоЗаПериод / ПериодовВсего;
	ТабличныйДокумент.Присоединить(ОблП_Итого);
	
КонецПроцедуры//сформироватьНаСервере

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоРуководительОтделаПродаж = НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("ОтчетыМаркетолога");
	
	Элементы.ФормаПоказатьСкрытьПараметры.Видимость = НЕ ЭтоРуководительОтделаПродаж;
	Элементы.ГруппаПараметры.Видимость = НЕ ЭтоРуководительОтделаПродаж;
	
	Группировки.Добавить("Подразделения",, НЕ ЭтоРуководительОтделаПродаж);
	Группировки.Добавить("Менеджеры",, ЭтоРуководительОтделаПродаж);
	Группировки.Добавить("Сегменты", "Сегменты номенклатуры", Ложь);
	Группировки.Добавить("Регионы",, Ложь);
	Группировки.Добавить("Реклама",, Истина);
	
	Периодичность = "ПоДням";
	
	ВидОтбораМенеджеры = "НеИспользоватьОтбор";
	Если ЭтоРуководительОтделаПродаж Тогда
		ВидОтбораПодразделения = "ВСписке";
		ОтборПодразделения.Очистить();
		ОтборПодразделения.Добавить(ПараметрыСеанса.ТекущийПользователь.Подразделение);
	Иначе
		ВидОтбораПодразделения = "НеИспользоватьОтбор";
	КонецЕсли;	
	
	
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура ПоказатьСкрытьПараметры(Команда)
	Элементы.ГруппаПараметры.Видимость = НЕ Элементы.ГруппаПараметры.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	ВариантыОтчетов.ПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
КонецПроцедуры
